# SetToIdentity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform2D..::..SetToIdentity Method
Transform2D Class See Also
---
Set this TrfUV to the identity transform.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Transform2D SetToIdentity()
```

Visual Basic
---
```text
Public Function SetToIdentity As Transform2D
```

Visual C++
---
```text
public:
Transform2D^ SetToIdentity()
```

# ### Return Value
Returns a pointer to "this" Transform2D.
# See Also
Transform2D Class
Autodesk.Revit.DB Namespace